# DATAFRAME

In [1]:
import numpy as np
import pandas as pd

In [6]:
from numpy.random import randn

In [18]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X', 'Y', 'Z'])
df #each rows and columns are series of pandas

          W         X         Y         Z
A -1.935140  0.055985  0.287182 -0.426181
B -1.868060 -2.174240 -0.698436  0.898522
C  0.076159 -1.200018 -0.376052 -0.387468
D  1.832145 -0.267268  2.512014  0.324699
E -0.748359  1.812975  1.105256 -2.087705

In [19]:
df['W']

A   -1.935140
B   -1.868060
C    0.076159
D    1.832145
E   -0.748359
Name: W, dtype: float64

In [20]:
df[['W','Y']]

          W         Y
A -1.935140  0.287182
B -1.868060 -0.698436
C  0.076159 -0.376052
D  1.832145  2.512014
E -0.748359  1.105256

In [21]:
df['W']['E']

-0.7483593870065878

In [22]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -1.935140  0.055985  0.287182 -0.426181 -1.647958
B -1.868060 -2.174240 -0.698436  0.898522 -2.566496
C  0.076159 -1.200018 -0.376052 -0.387468 -0.299893
D  1.832145 -0.267268  2.512014  0.324699  4.344159
E -0.748359  1.812975  1.105256 -2.087705  0.356897

In [26]:
df.drop('new', axis=1)

          W         X         Y         Z
A -1.935140  0.055985  0.287182 -0.426181
B -1.868060 -2.174240 -0.698436  0.898522
C  0.076159 -1.200018 -0.376052 -0.387468
D  1.832145 -0.267268  2.512014  0.324699
E -0.748359  1.812975  1.105256 -2.087705

In [27]:
df['add'] = ['1','2','3','4','5']

In [29]:
df

          W         X         Y         Z       new add
A -1.935140  0.055985  0.287182 -0.426181 -1.647958   1
B -1.868060 -2.174240 -0.698436  0.898522 -2.566496   2
C  0.076159 -1.200018 -0.376052 -0.387468 -0.299893   3
D  1.832145 -0.267268  2.512014  0.324699  4.344159   4
E -0.748359  1.812975  1.105256 -2.087705  0.356897   5

In [30]:
df.drop('add',axis=1) #etti matraii halda delete hunna

          W         X         Y         Z       new
A -1.935140  0.055985  0.287182 -0.426181 -1.647958
B -1.868060 -2.174240 -0.698436  0.898522 -2.566496
C  0.076159 -1.200018 -0.376052 -0.387468 -0.299893
D  1.832145 -0.267268  2.512014  0.324699  4.344159
E -0.748359  1.812975  1.105256 -2.087705  0.356897

In [31]:
df

          W         X         Y         Z       new add
A -1.935140  0.055985  0.287182 -0.426181 -1.647958   1
B -1.868060 -2.174240 -0.698436  0.898522 -2.566496   2
C  0.076159 -1.200018 -0.376052 -0.387468 -0.299893   3
D  1.832145 -0.267268  2.512014  0.324699  4.344159   4
E -0.748359  1.812975  1.105256 -2.087705  0.356897   5

In [32]:
df.drop('add',axis=1, inplace=True) #inplace halesi
#balla permanently delete hunxa

In [41]:
df

          W         X         Y         Z       new
A -1.935140  0.055985  0.287182 -0.426181 -1.647958
B -1.868060 -2.174240 -0.698436  0.898522 -2.566496
C  0.076159 -1.200018 -0.376052 -0.387468 -0.299893
D  1.832145 -0.267268  2.512014  0.324699  4.344159
E -0.748359  1.812975  1.105256 -2.087705  0.356897

In [44]:
df.drop('E', axis=0)

          W         X         Y         Z       new
A -1.935140  0.055985  0.287182 -0.426181 -1.647958
B -1.868060 -2.174240 -0.698436  0.898522 -2.566496
C  0.076159 -1.200018 -0.376052 -0.387468 -0.299893
D  1.832145 -0.267268  2.512014  0.324699  4.344159

In [48]:
#SELECTING ROWS
#label based
df.loc['A']

W     -1.935140
X      0.055985
Y      0.287182
Z     -0.426181
new   -1.647958
Name: A, dtype: float64

In [50]:
#numeric based
df.iloc[2]

W      0.076159
X     -1.200018
Y     -0.376052
Z     -0.387468
new   -0.299893
Name: C, dtype: float64

In [52]:
df.loc['B','Y']

-0.6984363369427831

In [55]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.055985  0.287182
B -2.174240 -0.698436

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.971350 -0.398162  0.616681  0.135305
B  0.545726 -1.329682 -0.270020 -2.017993
C  1.585680  0.428893  0.383314 -0.111614
D -0.087813  0.275084 -1.214569 -0.010577
E  1.018291 -0.450011  1.681687 -1.800989

In [6]:
booldf = df>0
booldf

       W      X      Y      Z
A   True  False   True   True
B   True  False  False  False
C   True   True   True  False
D  False   True  False  False
E   True  False   True  False

In [7]:
df[booldf]

          W         X         Y         Z
A  0.971350       NaN  0.616681  0.135305
B  0.545726       NaN       NaN       NaN
C  1.585680  0.428893  0.383314       NaN
D       NaN  0.275084       NaN       NaN
E  1.018291       NaN  1.681687       NaN

In [8]:
df[df>1]

          W   X         Y   Z
A       NaN NaN       NaN NaN
B       NaN NaN       NaN NaN
C  1.585680 NaN       NaN NaN
D       NaN NaN       NaN NaN
E  1.018291 NaN  1.681687 NaN

In [9]:
df

          W         X         Y         Z
A  0.971350 -0.398162  0.616681  0.135305
B  0.545726 -1.329682 -0.270020 -2.017993
C  1.585680  0.428893  0.383314 -0.111614
D -0.087813  0.275084 -1.214569 -0.010577
E  1.018291 -0.450011  1.681687 -1.800989

In [10]:
df['W']>0

A     True
B     True
C     True
D    False
E     True
Name: W, dtype: bool

In [12]:
df.loc['E']>0

W     True
X    False
Y     True
Z    False
Name: E, dtype: bool

In [13]:
df[df['W']>0]

          W         X         Y         Z
A  0.971350 -0.398162  0.616681  0.135305
B  0.545726 -1.329682 -0.270020 -2.017993
C  1.585680  0.428893  0.383314 -0.111614
E  1.018291 -0.450011  1.681687 -1.800989

In [14]:
df

          W         X         Y         Z
A  0.971350 -0.398162  0.616681  0.135305
B  0.545726 -1.329682 -0.270020 -2.017993
C  1.585680  0.428893  0.383314 -0.111614
D -0.087813  0.275084 -1.214569 -0.010577
E  1.018291 -0.450011  1.681687 -1.800989

In [18]:
resultdf = df[df['Z']>0]
resultdf

         W         X         Y         Z
A  0.97135 -0.398162  0.616681  0.135305

In [22]:
df[df['W']>0][['X','Y']]

          X         Y
A -0.398162  0.616681
B -1.329682 -0.270020
C  0.428893  0.383314
E -0.450011  1.681687

In [25]:
df[(df['W']>0) & (df['X']<0)] #cannot use and

          W         X         Y         Z
A  0.971350 -0.398162  0.616681  0.135305
B  0.545726 -1.329682 -0.270020 -2.017993
E  1.018291 -0.450011  1.681687 -1.800989